Week_6/24_11/Exercise/Demo 10/app/controllers/employees_controller.rb

SELECT `employees`.* FROM `employees`
---
  def index
    # @employees = Employee.all

    @pagy, @employees = pagy(Employee.all)

INSERT INTO `employees` (`employee_name`, `gender`, `hobbies`, `created_at`, `updated_at`) VALUES ('a', 'male', '[\"Reading\"]', '2023-11-25 04:38:33.029726', '2023-11-25 04:38:33.029726')
---
  def create
    @employee = Employee.create(employee_params)

SELECT `employees`.* FROM `employees` WHERE `employees`.`id` = 1 LIMIT 1
---
  def set_employee_params
    @employee = Employee.find(params[:id])